In [1]:
# import relevant libraries 
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
# Read in the data
schools = pd.read_csv("schools.csv")

# remove the first two digits from building code
schools['building_code'] = schools['building_code'].str[2:]

# Preview the data
schools.head()

,building_code,school_name,test_takers_count,average_reading,average_math,average_writing,borough
0,M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363,Manhattan
1,M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366,Manhattan
2,M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370,Manhattan
3,M458,FORSYTH SATELLITE ACADEMY,7,414,401,359,Manhattan
4,M509,MARTA VALLE HIGH SCHOOL,44,390,433,384,Manhattan

In [5]:
schools['borough'].value_counts()

Brooklyn         138
Bronx            128
Manhattan        121
Queens            78
Staten Island     13
Name: borough, dtype: int64

In [6]:
#checking the number of rows and columns in our dataset
schools.shape

(478, 7)

In [7]:
#checking additional info
schools.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 478 entries, 0 to 477
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   building_code      478 non-null    object
 1   school_name        478 non-null    object
 2   test_takers_count  478 non-null    object
 3   average_reading    478 non-null    object
 4   average_math       478 non-null    object
 5   average_writing    478 non-null    object
 6   borough            478 non-null    object
dtypes: object(7)
memory usage: 26.3+ KB

In [8]:
#checking for nulls
schools.isnull().sum()

building_code        0
school_name          0
test_takers_count    0
average_reading      0
average_math         0
average_writing      0
borough              0
dtype: int64

In [9]:
#previewing values
schools['school_name'].unique() #cannot detect foreign value
schools['test_takers_count'].unique() #string s found
schools['test_takers_count'].replace('s', 'null', inplace=True) #replace s values with null
schools['test_takers_count'].unique() #confirm replacement

array(['29', '91', '70', '7', '44', '112', '159', '18', '130', '16', '62',
       '53', '58', '85', '48', '76', '50', '40', '69', '42', '60', '92',
       'null', '79', '263', '54', '94', '104', '114', '66', '103', '127',
       '144', '336', '84', '95', '59', '72', '49', '151', '832', '167',
       '25', '81', '264', '131', '73', '14', '78', '26', '77', '56', '30',
       '33', '121', '9', '335', '36', '83', '154', '191', '270', '61',
       '27', '41', '12', '32', '261', '531', '75', '35', '111', '43',
       '375', '51', '31', '20', '214', '101', '55', '63', '24', '228',
       '65', '34', '64', '28', '47', '52', '67', '39', '415', '6', '68',
       '80', '74', '38', '113', '86', '57', '443', '731', '109', '99',
       '10', '46', '97', '189', '37', '1277', '90', '105', '8', '13',
       '89', '185', '102', '134', '142', '141', '71', '165', '259', '17',
       '182', '456', '238', '694', '385', '475', '727', '448', '119',
       '824', '518', '236', '11', '155', '320', '241', '138', '396', '45',
       '558', '347', '278', '888', '934', '334', '708', '175', '87', '93',
       '404', '403', '194', '762', '462', '422', '98', '395', '392',
       '174', '148', '143', '135', '137', '107', '391', '271', '807',
       '535', '227', '88', '23'], dtype=object)

In [10]:
#checking unique values in average reading column
schools['average_reading'].unique()
schools['average_reading'].replace('s', 'null', inplace=True) #replace s values with null
schools['average_reading'].unique() #confirm replacement

array(['355', '383', '377', '414', '390', '332', '522', '417', '624',
       '395', '409', '394', '374', '423', '404', '353', '375', '403',
       '408', '373', '391', '473', 'null', '319', '465', '492', '509',
       '496', '537', '517', '468', '572', '528', '429', '416', '356',
       '441', '378', '376', '679', '443', '370', '469', '407', '336',
       '389', '412', '368', '405', '498', '527', '350', '345', '458',
       '426', '399', '444', '406', '384', '371', '577', '566', '396',
       '433', '401', '354', '461', '432', '369', '358', '357', '413',
       '360', '605', '362', '380', '365', '363', '400', '430', '339',
       '364', '379', '310', '361', '351', '420', '367', '387', '398',
       '337', '402', '366', '324', '372', '411', '393', '459', '386',
       '382', '315', '314', '438', '304', '300', '392', '343', '419',
       '632', '348', '636', '381', '431', '388', '347', '321', '342',
       '352', '439', '587', '305', '435', '471', '586', '397', '359',
       '287', '338', '457', '418', '385', '476', '425', '313', '410',
       '341', '279', '326', '478', '436', '524', '456', '349', '311',
       '317', '545', '445', '455', '621', '480', '462', '499', '452',
       '513', '612', '504', '323', '487', '472', '424', '437', '466',
       '635', '428'], dtype=object)

In [11]:
#checking unique values in average math column
schools['average_math'].unique()
schools['average_math'].replace('s', 'null', inplace=True) #replace s values with null
schools['average_math'].unique() #confirm replacement

array(['404', '423', '402', '401', '433', '557', '574', '418', '604',
       '400', '393', '384', '375', '438', '449', '358', '388', '392',
       '390', '370', '391', '483', 'null', '512', '493', '465', '490',
       '563', '590', '533', '492', '594', '553', '399', '426', '357',
       '473', '365', '416', '460', '387', '735', '489', '349', '472',
       '440', '425', '378', '395', '371', '581', '436', '508', '337',
       '517', '403', '379', '382', '441', '424', '368', '575', '564',
       '398', '369', '506', '514', '421', '446', '351', '318', '366',
       '353', '360', '474', '361', '654', '376', '380', '422', '456',
       '364', '324', '359', '394', '396', '356', '411', '381', '386',
       '385', '373', '355', '464', '367', '480', '363', '339', '312',
       '419', '315', '455', '412', '406', '333', '408', '350', '420',
       '688', '362', '435', '648', '471', '397', '372', '344', '432',
       '323', '346', '374', '417', '659', '383', '443', '499', '584',
       '410', '377', '335', '415', '341', '342', '462', '481', '413',
       '320', '322', '478', '486', '477', '427', '437', '496', '468',
       '414', '519', '475', '561', '409', '338', '454', '429', '568',
       '447', '498', '463', '451', '651', '458', '545', '539', '523',
       '434', '537', '491', '445', '452', '497', '660', '488', '682',
       '317', '444'], dtype=object)

In [12]:
#checking unique values in average reading column
schools['average_writing'].unique()
schools['average_writing'].replace('s', 'null', inplace=True) #replace s values with null
schools['average_writing'].unique() #confirm replacement

array(['363', '366', '370', '359', '384', '316', '525', '411', '628',
       '387', '392', '378', '362', '432', '416', '340', '385', '405',
       '390', '394', '479', 'null', '357', '461', '467', '523', '518',
       '550', '515', '459', '592', '533', '381', '428', '391', '349',
       '458', '368', '388', '360', '682', '442', '351', '475', '393',
       '400', '420', '344', '382', '335', '431', '352', '477', '512',
       '345', '343', '403', '429', '426', '376', '430', '408', '374',
       '358', '577', '402', '361', '373', '455', '395', '448', '333',
       '398', '342', '364', '404', '355', '588', '367', '399', '346',
       '423', '326', '348', '311', '371', '383', '407', '389', '375',
       '350', '413', '365', '356', '377', '415', '457', '297', '339',
       '379', '369', '440', '302', '301', '330', '372', '410', '427',
       '649', '414', '354', '317', '636', '433', '353', '419', '341',
       '298', '312', '418', '587', '570', '396', '380', '300', '425',
       '334', '291', '441', '386', '286', '424', '314', '435', '476',
       '439', '542', '331', '332', '421', '329', '406', '443', '318',
       '481', '638', '489', '464', '401', '496', '454', '502', '596',
       '412', '494', '491', '544', '450', '466', '417', '470', '397',
       '422'], dtype=object)

In [13]:
#counting unique values
schools['test_takers_count'].value_counts()

null    57
54      10
9        8
72       8
48       8
        ..
1277     1
263      1
189      1
97       1
23       1
Name: test_takers_count, Length: 175, dtype: int64

In [14]:
schools['average_reading'].value_counts()

null    57
398      8
384      8
367      8
370      8
        ..
324      1
465      1
492      1
337      1
428      1
Name: average_reading, Length: 164, dtype: int64

In [15]:
schools['average_math'].value_counts()

null    57
385      9
364      8
391      8
381      8
        ..
464      1
574      1
604      1
324      1
444      1
Name: average_math, Length: 173, dtype: int64

In [16]:
schools['average_writing'].value_counts()

null    57
368      9
370      9
394      8
359      8
        ..
418      1
570      1
523      1
461      1
422      1
Name: average_writing, Length: 163, dtype: int64

In [17]:
schools['building_code'].value_counts()

X478    2
M292    1
K489    1
K635    1
K633    1
       ..
X540    1
X537    1
X530    1
X519    1
X490    1
Name: building_code, Length: 477, dtype: int64

In [21]:
#dropping all rows containing null values I created
schools = schools[~schools.isin(['null']).any(axis=1)]
schools

,building_code,school_name,test_takers_count,average_reading,average_math,average_writing,borough
0,M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363,Manhattan
1,M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366,Manhattan
2,M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370,Manhattan
3,M458,FORSYTH SATELLITE ACADEMY,7,414,401,359,Manhattan
4,M509,MARTA VALLE HIGH SCHOOL,44,390,433,384,Manhattan
...,...,...,...,...,...,...,...
466,K556,BUSHWICK LEADERS HIGH SCHOOL FOR ACADEMIC EXCE...,23,347,358,350,Brooklyn
467,K564,BUSHWICK COMMUNITY HIGH SCHOOL,24,359,317,358,Brooklyn
471,Q811,P.S. Q811,32,429,444,433,Queens
476,Q950,GED PLUS s CITYWIDE,8,496,400,426,Queens
477,X490,PHOENIX ACADEMY,9,367,370,360,Bronx

In [22]:
#checking all columns to confirm nulls dropped
schools['average_writing'].value_counts()
schools['average_reading'].value_counts()
schools['average_math'].value_counts()
schools['test_takers_count'].value_counts()

54     10
48      8
9       8
72      8
29      7
       ..
97      1
109     1
731     1
443     1
23      1
Name: test_takers_count, Length: 174, dtype: int64

In [24]:
#Now working with 421 entries
schools.shape

(421, 7)

In [39]:
# changing dtypes
schools['school_name'] = schools['school_name'].astype('category')
schools['test_takers_count'] = schools['test_takers_count'].astype('int')
schools['average_reading'] = schools['average_reading'].astype('float')
schools['average_math'] = schools['average_math'].astype('float')
schools['average_writing'] = schools['average_writing'].astype('float')

In [40]:
#checking the total number of schools in the dataset
number_of_schools_desc = schools['school_name'].describe()
number_of_schools_desc

count                                                   421
unique                                                  421
top       47 THE AMERICAN SIGN LANGUAGE AND ENGLISH SECO...
freq                                                      1
Name: school_name, dtype: object

In [54]:
#The best math results is at least 80% of 800
print(f'The least score 80% of 800 for math is: {0.8 * 800}')

The least score 80% of 800 for math is: 640.0

In [55]:
#Finding the best math schools by school_name and average_math in descending order
best_math_schools = schools[schools['average_math'] >= 640][['school_name', 'average_math']].sort_values('average_math', ascending = False)
best_math_schools

                                           school_name  average_math
48                              STUYVESANT HIGH SCHOOL         735.0
198                       BRONX HIGH SCHOOL OF SCIENCE         688.0
459                STATEN ISLAND TECHNICAL HIGH SCHOOL         682.0
427  QUEENS HIGH SCHOOL FOR THE SCIENCES AT YORK CO...         660.0
249                     BROOKLYN TECHNICAL HIGH SCHOOL         659.0
107  HIGH SCHOOL FOR MATHEMATICS, SCIENCE AND ENGIN...         654.0
396                        TOWNSEND HARRIS HIGH SCHOOL         651.0
206  HIGH SCHOOL OF AMERICAN STUDIES AT LEHMAN COLLEGE         648.0

What are the top 10 performing schools based on the combined SAT scores?

In [56]:
#creating column for combined SAT scores, total_SAT
schools['total_SAT'] = schools['average_math'] + schools['average_reading'] + schools['average_writing']

In [57]:
#Finding top 10 schools
top_10_schools = schools[['school_name', 'total_SAT']].sort_values('total_SAT', ascending = False).head(10)
top_10_schools

                                           school_name  total_SAT
48                              STUYVESANT HIGH SCHOOL     2096.0
198                       BRONX HIGH SCHOOL OF SCIENCE     1969.0
459                STATEN ISLAND TECHNICAL HIGH SCHOOL     1953.0
206  HIGH SCHOOL OF AMERICAN STUDIES AT LEHMAN COLLEGE     1920.0
396                        TOWNSEND HARRIS HIGH SCHOOL     1910.0
427  QUEENS HIGH SCHOOL FOR THE SCIENCES AT YORK CO...     1868.0
8                       BARD HIGH SCHOOL EARLY COLLEGE     1856.0
107  HIGH SCHOOL FOR MATHEMATICS, SCIENCE AND ENGIN...     1847.0
249                     BROOKLYN TECHNICAL HIGH SCHOOL     1833.0
33                       ELEANOR ROOSEVELT HIGH SCHOOL     1758.0

Which single borough has the largest standard deviation in the combined SAT score?

In [58]:
schools['borough'].unique()

array(['Manhattan', 'Bronx', 'Brooklyn', 'Queens', 'Staten Island'],
      dtype=object)

In [59]:
#Finding the standard deviation, average and the number of schools in combined SAT score for each borough
boroughs = schools.groupby('borough')['total_SAT'].agg(['std','mean','count']).round(2)

#sort by std
boroughs.sort_values('std')

                  std     mean  count
borough
Brooklyn       137.03  1167.36    123
Bronx          137.88  1144.58    110
Queens         176.02  1275.37     70
Manhattan      202.44  1260.18    106
Staten Island  205.54  1359.17     12

In [60]:
#the lower the std, the better
numbers_schools = boroughs['count']
numbers_schools

borough
Bronx            110
Brooklyn         123
Manhattan        106
Queens            70
Staten Island     12
Name: count, dtype: int64

In [61]:
#finding the single borough with the largest standard deviation in combined SAT
largest_std_dev = boroughs[boroughs['std']== boroughs['std'].max()]
largest_std_dev = largest_std_dev.rename(columns={"count": "num_schools", "mean": "average_SAT", "std": "std_SAT"})
largest_std_dev

               std_SAT  average_SAT  num_schools
borough
Staten Island   205.54      1359.17           12